sdaiIsSubtypeOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether an entity definition is a subtype of another entity definition.
\param subtype   [in] A subtype to check.
\param supertype [in] A supertype to check.
\returns sdaiTRUE if the specified entity has a type that is a subtype of the specified supertype; otherwise, the function returns sdaiFALSE.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiED_NDEF - Entity definition not defined.
* sdaiED_NDEQ - Entity definition not domain equivalent.
* sdaiSD_NDEF - Schema definition not defined.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiEntity entIfcRoot = sdaiGetEntity(pModel, "ifcRoot");
SdaiBoolean isIfcRootSubtypeOfIfcRoot = sdaiIsSubtypeOf(entIfcRoot, entIfcRoot);